In [1]:
import pandas as pd

In [2]:
cars = pd.Series(['Toyota' , 'Nissan' , 'Honda' , 'Volvo'])
cars

0    Toyota
1    Nissan
2     Honda
3     Volvo
dtype: object

In [4]:
colours = pd.Series(['Red' , 'Yellow' , 'Blue' , 'Black'])
colours

0       Red
1    Yellow
2      Blue
3     Black
dtype: object

In [6]:
df = pd.DataFrame({"Car Types" : cars , "Colours" : colours})
df

  Car Types Colours
0    Toyota     Red
1    Nissan  Yellow
2     Honda    Blue
3     Volvo   Black

# Exercise

In [7]:
foods = pd.Series(["Rolls" , "Noodles" , "Pizzas" , "Burgers"])
foods

0      Rolls
1    Noodles
2     Pizzas
3    Burgers
dtype: object

In [8]:
price = pd.Series([2 , 1 , 3 , 2])
price

0    2
1    1
2    3
3    2
dtype: int64

In [9]:
df = pd.DataFrame({"Food items" : foods , "Food Price" : price})
df

  Food items  Food Price
0      Rolls           2
1    Noodles           1
2     Pizzas           3
3    Burgers           2

# Exercise

In [11]:
heart_disease = pd.read_csv("11.2 heart-disease.csv")
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0